tap "gentleman-programming/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Package compiler and linker metadata toolkit
brew "pkgconf"
# C parser in Python
brew "pycparser"
# Python version management
brew "pyenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Persistent memory for AI coding agents. Agent-agnostic, single binary, zero dependencies.
brew "gentleman-programming/tap/engram"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "timonwong.shellcheck"
