# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Rainbows and unicorns in your console!
brew "lolcat"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Package compiler and linker metadata toolkit
brew "pkgconf"
# C parser in Python
brew "pycparser"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Validating, recursive, caching DNS resolver
brew "unbound"
# UNIX shell (command interpreter)
brew "zsh"
# Menu bar usage monitor for Codex and Claude
cask "codexbar"
# Write, edit, and chat about your code with AI
cask "cursor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# AI usage tracker for Cursor, Claude Code, Codex, Copilot and more
cask "openusage"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Gecko based web browser
cask "zen"
