tap "gentleman-programming/tap"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Package compiler and linker metadata toolkit
brew "pkgconf"
# C parser in Python
brew "pycparser"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Persistent memory for AI coding agents. Agent-agnostic, single binary, zero dependencies.
brew "gentleman-programming/tap/engram"
# AI Gentle Stack — One command to configure any AI coding agent on any OS.
brew "gentleman-programming/tap/gentle-ai"
# Gentleman Guardian Angel - Provider-agnostic code review using AI (Claude, Gemini, Codex, OpenCode, Ollama)
brew "gentleman-programming/tap/gga"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Gecko based web browser
cask "zen"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "mkhl.shfmt"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "timonwong.shellcheck"
