tap "anomalyco/tap"
tap "gentleman-programming/tap"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Handy way to save and run project-specific commands
brew "just"
# Find what models run on your hardware
brew "llmfit"
# Utility for directing compilation
brew "make"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Package compiler and linker metadata toolkit
brew "pkgconf"
# C parser in Python
brew "pycparser"
# Python version management
brew "pyenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Persistent memory for AI coding agents. Agent-agnostic, single binary, zero dependencies.
brew "gentleman-programming/tap/engram"
# AI Gentle Stack — One command to configure any AI coding agent on any OS.
brew "gentleman-programming/tap/gentle-ai"
# Gentleman Guardian Angel - Provider-agnostic code review using AI (Claude, Gemini, Codex, OpenCode, Ollama)
brew "gentleman-programming/tap/gga"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Gecko based web browser
cask "zen"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "mkhl.shfmt"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "nefrob.vscode-just-syntax"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
